11/data/attachments/6cca7955efd62ca1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_f44feef8-80c9-46ad-b346-0d43c6c31f8f</nif:username>
            <nif:friendToBeAdded>William_Republican_Friend_24237_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>